keys_ru = "Подарок водителю engl_orig, подарок в машину engl_orig, Подарок для водителя ru_orig, подарок водителю ru_orig, Подарок в машину ru_orig, Чехлы ru_orig, авто чехлы ru_orig, чехлы для сидений engl_orig, автомобильные чехлы на ru_orig, чехлы для автокресел ru_orig, Накидки на сиденья engl_orig, Накидки с алькантары на сиденья engl_orig, Накидки с велюра на сиденья engl_orig, Накидки с замши на сиденья engl_orig, Накидки на авто кресла engl_orig, накидки для сидений ru_small, автомобильные накидки на сиденья ru_small, накидки из алькантары для ru_small, накидки на кресла ru_small, накидки на сиденья автомобиля ru_small, накидки из алькантры на сиденья ru_small, чехлы сидений с алькантары для ru_small, авточехлы для ru_small, чехлы для сидений ru_small, автомобильные чехлы с алькантары ru_small, чехлы для автокресел ru_small, накидки с эко замша для сидений ru_small, накидки из замша для салона ru_small"
keys_ukr = "Подарунок водієві engl_orig, подарунок в машину engl_orig, Подарунок для водія ukr_orig, подарунок водієві ukr_orig, Подарунок в машину ukr_orig, Чохли ukr_orig, авточохли ukr_orig, чохли для сидінь engl_orig, автомобільні чохли на ukr_orig, чохли для автокрісел ukr_orig, Накидки на сидіння engl_orig, Накидки з алькантари на сидіння engl_orig, Накидки з велюра на сидіння engl_orig, Накидки з замши на сидіння engl_orig, Накидки на авто крісла engl_orig, накидки для сидінь ukr_small, автомобільні накидки на сидіння ukr_small, накидки із алькантари для ukr_small, накидки на крісла ukr_small, накидки на сидіння автомобіля ukr_small, накидки із алькантари на сидіння ukr_small, чохли сидінь із алькантары для ukr_small, авточохли для ukr_small, чохли для сидінь ukr_small, автомобільні чохли з алькантари ukr_small, чохли для автокрісел ukr_small, накидки з еко замша для сидінь ukr_small, накидки из замша для салона ukr_small"

data_changes = {
    # region Default characteristics
    "Валюта": "UAH",        #10
    "Наличие": "!",         #16
    "Адрес подраздела": "https://prom.ua/Chehly-dlya-avtokresel", #20
    "Идентификатор подраздела": "121234",   #27
    "Цена от": "-",          #37
    # endregion

    # region Main characteristics
    # If len(colours) == 1 it will be 1 position only
    "colours": ("Черный", ),
    "colours_ukr": ("Чоний", ),

    # name - main name (ru and ukr), name_en - english name, name2 - seats or years
    "name_ru": "",
    "name_ukr": "",

    "names_with_colours": False,    # 1 - Різновиди будуть із кольорами в кінці назви ; 0 - Без кольорів
    "first_name_colour": True,      # 1 - Назва головного кольору теж буде зі словом кольору; 0 - без слова

    "One group": False,             # 1 - Одна задана група
    "New groups": True,             # 1 - Будуть створюватися нові групи під кожну марку; 0 - Товари зайдуть у вже створені групи
    "Parent group": True,           # 1 - Буде створено батьківську групу та приєднано підгрупи; 0 - Не буде батьківської підгрупи

    "Photo from file": True,        # 1 - Буде відкрито файл .json і взято дані з нього; 0 - Взято дані з наступного рядка

    "Артикул": ("mot- 0", 500),     # Text, number
    "Цена": True,                   # 1 - Ціна береться з файлу даних; Int - Задати власну ціну
    "Комплектация": "комплект",
    "Производитель": "Собственное производство",
    "Страна_производства": "Украина",
    "Личные_заметки": "",
    "Кількість описів": 1,

    "Дополнительные_характеристики": {
        "Цвет": True,           # 1 - Змінювати не обов'язково, просто ініціалізація списку кольорів; 0 - Не буде кольорів
        "Тип чехла": "",
        "Материал": "",
        "Комплектация набора": "",
        "Размер чехла": "",
        "Состояние": "Новое",

        # 1 - Буде присутнє; 0 - Буде відсутнє
        "Марка": True,
        "Модель": True,
        "Серия": False,
        "Год выпуска автомобиля": False
    },
    # endregion
}

PRODUCTS_COLUMNS = {
        1: "Код_товара",
        2: "Название_позиции",
        3: "Название_позиции_укр",
        4: "Поисковые_запросы",
        5: "Поисковые_запросы_укр",
        6: "Описание",
        7: "Описание_укр",
        8: "Тип_товара",
        9: "Цена",
        10: "Валюта",
        11: "Единица_измерения",
        12: "Минимальный_объем_заказа",
        13: "Оптовая_цена",
        14: "Минимальный_заказ_опт",
        15: "Ссылка_изображения",
        16: "Наличие",
        17: "Количество",
        18: "Номер_группы",
        19: "Название_группы",
        20: "Адрес_подраздела",
        21: "Возможность_поставки",
        22: "Срок_поставки",
        23: "Способ_упаковки",
        24: "Способ_упаковки_укр",
        25: "Уникальный_идентификатор",
        26: "Идентификатор_товара",
        27: "Идентификатор_подраздела",
        28: "Идентификатор_группы",
        29: "Производитель",
        30: "Страна_производитель",
        31: "Скидка",
        32: "ID_группы_разновидностей",
        33: "Личные_заметки",
        34: "Продукт_на_сайте",
        35: "Срок_действия_скидки_от",
        36: "Срок_действия_скидки_до",
        37: "Цена_от",
        38: "Ярлык",
        39: "HTML_заголовок",
        40: "HTML_заголовок_укр",
        41: "HTML_описание",
        42: "HTML_описание_укр",
        43: "Код_маркировки_(GTIN)",
        44: "Номер_устройства_(MPN)",
        45: "Вес,кг",
        46: "Ширина,см",
        47: "Высота,см",
        48: "Длина,см",
        49: "Где_находится_товар",
}

GROUPS_COLUMNS = {
        1: "Номер_группы",
        2: "Название_группы",
        3: "Название_группы_укр",
        4: "Идентификатор_группы",
        5: "Номер_родителя",
        6: "Идентификатор_родителя",
        7: "HTML_заголовок_группы",
        8: "HTML_заголовок_группы_укр",
        9: "HTML_описание_группы",
        10: "HTML_описание_группы_укр",
        11: "Описание_группы_до_списка_товарных_позиций",
        12: "Описание_группы_до_списка_товарных_позиций_укр",
        13: "Описание_группы_после_списка_товарных_позиций",
        14: "Описание_группы_после_списка_товарных_позиций_укр",
}